---
kind: type
id: T:Autodesk.Revit.DB.Wall
zh: 墙、墙体
source: html/b5891733-c602-12df-beab-da414b58d608.htm
---
# Autodesk.Revit.DB.Wall

**中文**: 墙、墙体

Represents a wall in Autodesk Revit.

## Syntax (C#)
```csharp
public class Wall : HostObject
```

## Remarks
The wall object represents all the different kinds of walls in Revit.